app/controllers/tracks_controller.rb

  def index
    @tracks = Track.search(params[:q])
---
SELECT "tracks".* FROM "tracks"